app/Controllers/LoginController.php


            $usuarioModel = new UsuarioModel();
            // Buscar al usuario por su email
            $usuario = $usuarioModel->where('email', $email)->first(); //
---
SELECT *
FROM `usuarios`
WHERE `email` = 'RRuiz@gmail.com'
 LIMIT 1