app/Controllers/UsuarioController.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `telefono`, `password`, `rol_id`, `baja`, `created_at`, `updated_at`) VALUES ('Juan', 'Perez', 'jPerez@gmail.com', '2211990044', '$2y$10$njaim0lolNwPcddNMCaQNeC6N2TXKpFLJhPrGrjvhEMTWSUObtK7O', 2, 0, '2025-06-26 01:59:37', '2025-06-26 01:59:37')
---
            ];

            // Insertar los datos en la base de datos
            if ($usuarioModel->insert($data)) {