app/Models/UsuarioModel.php

UPDATE `usuarios` SET `baja` = 1, `updated_at` = '2025-06-30 00:13:20'
WHERE `usuarios`.`id_usuario` IN (5)
---
    public function deleteUser(int $id): bool
    {
        $usuario = $this->find($id);
        if (!$usuario) {
            $this->errors = ['id' => 'Usuario no encontrado.'];
            return false;
        }

        try {
            return (bool) $this->update($id, ['baja' => self::ESTADO_INACTIVO]);

UPDATE `usuarios` SET `baja` = 0, `updated_at` = '2025-06-30 01:15:48'
WHERE `usuarios`.`id_usuario` IN (6)
---
    public function restoreUser(int $id): bool
    {
        $usuario = $this->find($id);
        if (!$usuario) {
            $this->errors = ['id' => 'Usuario no encontrado.'];
            return false;
        }

        // Solo podemos restaurar si está inactivo
        if ($usuario->isActive()) {
            $this->errors = ['status' => 'El usuario ya está activo.'];
            return false;
        }

        $data = ['baja' => 0]; // Marcar como activo

        if ($this->update($id, $data)) {

SELECT *
FROM `usuarios`
---
    public function getAllUsers(): array
    {
        return $this->findAll();